Repository: eldesh/coq_ja_work
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: In the fourth part more practical tools are documented.
ja: 第4部はより実用的なツールについて文書化しています。

source: In the same way, we give the superclasses as a binding context:
ja: 同様に、束縛コンテキストとしてスーパークラスを与えます:

source: In these binders, the binding name for the bound object is optional, whereas the type is mandatory, dually to regular binders.
ja: これらの束縛子の中では、束縛されたオブジェクトの束縛名はオプショナルですが、一方でその型は強制であり、通常の束縛子と双対的です。

source: In this case the types can be recursive and eta-conversion is disallowed.
ja: この場合は型は再帰でき、eta 変換は許されません。

source: In this case we associate to nat only one canonical value (since its class, ``nat_EQcl`` has just one member).
ja: この場合は nat に高々一つの正準値を関連付けました (そのクラスについても、``nat_EQcl`` はただ一つのメンバを持っています)。

source: In this sense, the :cmd:`Record` construction allows defining “signatures”.
ja: この場合、:cmd:`Record` は ”シグネチャ” の定義をすることができます。

source: Indexes
ja: 索引

source: Induction schemes are automatically generated for inductive records.
ja: 帰納スキームは帰納的レコードについて自動的に生成される。

source: Inside implicit generalization delimiters, free variables in the current context are automatically quantified using a product or a lambda abstraction to generate a closed term.
ja: 暗黙の一般化デリミタの中では、現在のコンテキスト中の自由変数は、閉じた項を生成するために積またはラムダ抽象を使うことで自動的に量化されます。

source: Installation
ja: インストール方法

source: Introduction
ja: はじめに

source: It also tests that they work as expected.
ja: それらが期待通りに動作することをテストもします。

source: It analyses the dependencies between subgoals to avoid backtracking on subgoals that are entirely independent.
ja: それは完全に独立したサブゴール上でのバックトラッキングを避けるため、サブゴール間の依存を解析します。

source: It can be activated for printing with
ja: それは以下によって表示を有効にすることが出来ます。

source: It can be used for redeclaring instances at the end of sections, or declaring structure projections as instances.
ja: それはセクションの終わりでインスタンスを再宣言したり、または構造の射影をインスタンスとして宣言するのに使えます。

source: It can happen that the definition of a projection is impossible.
ja: 射影の定義が不可能なことが起こり得ます。

source: It does so by allowing hints that conclude in a product to apply to a goal with a matching product directly, avoiding an introduction.
ja: それはある積の中で直接マッチする積を伴うゴールにイントロダクションを避けて適用すると結論を出すヒントを認めることで行います。

source: It infers all the other pieces of the class ``LEQ`` and declares them as canonical values associated to the ``T`` key.
ja: それは ``LEQ`` クラスの他の全ての部分を推論し、キーとなる ``T`` に関連付けられた正準値としてそれらを定義します。

source: It is actually a wrapper for several ways of defining a function *and other useful related objects*, namely: an induction principle that reflects the recursive structure of the function (see :tacn:`function induction`) and its fixpoint equality.
ja: それは実際には関数 *と他の便利な関連オブジェクト* を定義するいくつかの方法のラッパーであり、具体的には: その関数の再帰構造を反映する帰納法の原理 (:tacn:`function induction` 参照) とその不動点等式です。

source: It is also useful to declare constants which should never be unfolded during proof-search, like fixpoints or anything which does not look like an abbreviation.
ja: それは不動点や省略形のように見えない何かのような証明探索中にけっして展開されるべきではない定数を宣言するのにも便利です。

source: It is always used when calling the unifier.
ja: それは単一化器を呼ぶときに常に使われます。

source: It is divided in six chapters.
ja: ここは6つの章に分かれています。

source: It is is possible to do it directly in regular binders, and using the ``!`` modifier in class binders.
ja: それは通常の束縛子の中で直接行う、そしてクラス束縛子の中では ``!`` 修飾子を使うことで可能です。

source: It is possible to bind variable names to a given type (e.g. in a development using arithmetic, it may be convenient to bind the names `n` or `m` to the type ``nat`` of natural numbers).
ja: 変数名を与えられた型に束縛することが可能です (例: 算術を使う開発の中で、名前 `n` や `m` を自然数である ``nat`` 型に束縛すると便利かもしれません)

source: It is useful when some constants prevent some unifications and make resolution fail.
ja: いくつかの定数がいくらかの単一化を防ぎ、(訳注: 型クラス)解決を失敗させるのに便利です。

source: It might move to ``all:typeclasses eauto`` in future versions when the refinement engine will be able to backtrack.
ja: 精細化エンジンがバックトラック出来るようになったとき未来のバージョンではそれは ``all:typeclasses eauto`` に移動するかもしれない。

source: It provides a specification language named |Gallina|.
ja: Coqは、 |Gallina| と呼ばれる仕様記述言語を提供します。

source: It should be read as: “find a class e such that its objects have type T or fail with message "T is not an EQ.type"”.
ja: これは以下のように読めます: “あるクラス e を見つける。そのオブジェクトは型 T を持ち、そうでない場合は "T is not an EQ.type" というメッセージとともに失敗する”。

source: It treats typeclass subgoals the same as other subgoals (no shelving of non-typeclass goals in particular).
ja: それは型クラスサブゴールを他のサブゴールと同じに扱います (特に非型クラスゴールに先送りがないときは)。

source: It will be type checked when it is used, an in that case ``T`` is going to be a concrete type.
ja: それが使われ、``T`` が具体型になるときに型検査されます。

source: It will use local hypotheses as well as declared lemmas in the ``typeclass_instances`` database.
ja: それは ``typeclass_instances`` データベース内に定義された補題だけでなくローカルな仮定も使います。

source: Its syntax is described in the grammar below.
ja: 構文は以下で説明しています。

source: Let us define the rational :math:`1/2`:
ja: 有理数 :math:`1/2` を定義してみましょう:

source: Let us now see the work done by the ``Record`` macro.
ja: ``Record`` マクロによって行われる動作を見てみましょう。

source: License
ja: ライセンス

source: Like in ``Fixpoint``, the decreasing argument must be given (unless the function is not recursive), but it might not necessarily be *structurally* decreasing.
ja: ``Fixpoint`` のように、(関数が再帰していないときでさえ) 減少する引数を与えなければいけません、しかしそれが *構造的に* 減少している必要はありません。

source: Links to several tutorials can be found at https://coq.inria.fr/documentation and https://github.com/coq/coq/wiki#coq-tutorials
ja: https://coq.inria.fr/documentation や https://github.com/coq/coq/wiki#coq-tutorials には、幾つかのチュートリアルへのリンクがあります。

source: List of additional documentation
ja: その他の文書一覧

source: Make the identifiers opaque for typeclass search.
ja: 型クラス検索のために識別子を不透明にします。

source: Missing fields must be filled in interactive proof mode.
ja: 足りないフィールドは対話証明モードで埋められなければなりません。

source: More details and examples, and a description of the commands related to coercions are provided in :ref:`implicitcoercions`.
ja: より詳細と例、それにコアーションに関連するコマンドの説明は :ref:`implicitcoercions` で提供されます。

source: More generally, a record may have explicitly defined (a.k.a.
ja: より一般的には、レコードは明示的に定義されたフィールド (別名 マニフェスト) を持ち得ます。

source: Moreover the following are defined:
ja: さらに以下のものが定義されます。

source: Moreover, |Coq|’s compiler provides an output file containing a compact representation of its input.
ja: さらに、 |Coq| コンパイラは、入力のコンパクトな表現を持つ出力ファイルを生成します。

source: No methods or instances are defined.
ja: メソッドやインスタンスは定義されません。

source: Nonetheless, the manual has some structure that is explained below.
ja: とはいえ、このマニュアルも以下のような構造を持っています。

source: Notation overloading
ja: 表記法オーバーローディング

source: Note that in practice the user may want to declare ``EQ.obj`` as a coercion, but we will not do that here.
ja: 留意すべきは、実際にはユーザは ``EQ.obj`` をコアーションとして定義したいかもしれませんが、ここではそれは行いません。

source: Note that no direct proof of ``n <= m -> m <= n -> n == m`` is provided by the user for ``n`` and m of type ``nat * nat``.
ja: 注目すべきは ``nat * nat`` 型の ``n`` と m についての ``n <= m -> m <= n -> n == m`` の直接の証明はユーザから提供されていないことです。

source: Of course one would like to apply results proved in the algebraic setting to any concrete instate of the algebraic structure.
ja: もちろん代数的構造のどんな具体例についても代数的な背景の中で証明された結果を適用したい人もいるでしょう。

source: On the user level, primitive projections can be used as a replacement for the usual defined ones, although there are a few notable differences.
ja: ユーザレベルでは、いくらか注目すべき違いはありますが、プリミティブ射影は普通に定義されたそれを置き換えるのに使うことが出来ます。

source: Once a typeclass is declared, one can use it in class binders:
ja: 一度型クラスが宣言されると、それをクラス束縛子の中で使うことができます。

source: Once proof obligations are discharged, the following objects are defined:
ja: 証明課題が解決されると、以下のオブジェクトが定義されます:

source: One can also declare existing objects or structure projections using the Existing Instance command to achieve the same effect.
ja: 同じ効果を達成するために Existing Instance コマンドを使うことで既存のオブジェクトや構造の射影を宣言することも出来ます。

source: One can also parameterize classes by other classes, generating a hierarchy of classes and superclasses.
ja: 他のクラスによってクラスをパラメタライズし、クラスとスーパークラスの階層を生成することも出来ます。

source: One can also use implicit generalization for binders, in which case the generalized variables are added as binders and set maximally implicit.
ja: 束縛子にも暗黙の一般化を使うことができ、その場合は一般化された変数が束縛子として追加され最大限暗黙に設定されます。

source: One can control the set of generalizable identifiers with the ``Generalizable`` vernacular command to avoid unexpected generalizations when mistyping identifiers.
ja: ヴァーナキュラーコマンド ``Generalizable`` によって一般化できる識別子の集合をコントロールし、識別子を打ち間違えた時に望まない一般化を避けることが出来ます。

source: One can declare parameterized instances as in Haskell simply by giving the constraints as a binding context before the instance, e.g.:
ja: インスタンスの前に束縛コンテキストとして制約を与えることで Haskell のようにパラメータ化されたインスタンスを簡潔に宣言することが出来ます。例えば:

source: One can distinguish them from applications of the primitive projection if the :flag`Printing Primitive Projection Parameters` option is off: For a primitive projection application, parameters are printed as underscores while for the compatibility projections they are printed as usual.
ja: :flag`Printing Primitive Projection Parameters` オプションがオフになっているとそれらとプリミティブ射影の適用と区別することが出来ます。プリミティブ射影適用のときは、パラメータはアンダースコアとして表示される一方、互換性射影は普通に表示されます。

source: One can use alternatively the :cmd:`Program Instance` variant which has richer facilities for dealing with obligations.
ja: 替わりに :cmd:`Program Instance` という類型を使うことが出来、これは課題の扱いについてよりリッチな機能を持っています。

source: One can use the ``Global`` modifier on instances declared in a section so that their generalization is automatically redeclared after the section is closed.
ja: ``Global`` 修飾子はあるセクション中で宣言されたインスタンス上で、それらの一般化されたものがそのセクションが閉じられた後に自動的に再宣言されるように使うことができます。

source: One has to take care that the transparency of every field is determined by the transparency of the :cmd:`Instance` proof.
ja: :cmd:`Instance` の証明の透過性よって決まる全てのフィールドの透過性に注意するべきです。

source: One need not even mention the unique field name for singleton classes.
ja: シングルトンクラスについては一意なフィールド名に言及する必要すらありません。

source: One should take care not to make opaque any constant that is used to abbreviate a type, like:
ja: 以下のような、型を省略するために使われる定数を不透明にしないように注意するべきです:

source: Only `ident` is defined.
ja: `ident` だけが定義されました。

source: Only `ident` is defined; the induction scheme will not be generated.
ja: `ident` のみが定義され、帰納スキームは生成されません。

source: Optionally, you can enhance it with the minor mode Company-Coq :cite:`Pit16` (see https://github.com/cpitclaudel/company-coq).
ja: また、マイナーモード Company-Coq :cite:`Pit16` (https://github.com/cpitclaudel/company-coq) で拡張することもできます。

source: Options A and B are not elected.
ja: オプションAおよびBは選択しない。

source: Otherwise said, :flag:`Printing All` includes the effects of the options :flag:`Printing Implicit`, :flag:`Printing Coercions`, :flag:`Printing Synth`, :flag:`Printing Projections`, and :flag:`Printing Notations`.
ja: 他の言い方をすると :flag:`Printing All` はオプション :flag:`Printing Implicit`、:flag:`Printing Coercions`、:flag:`Printing Synth`、:flag:`Printing Projections`、:flag:`Printing Notations` の効果を含んでいます。

source: Otherwise said, :token:`qualid` is canonically used to extend the field |c_i| into a complete structure built on |c_i|.
ja: 別の言い方をすると、:token:`qualid` はフィールド |c_i| を |c_i| 上に構築した完全な構造に拡張するために規範的に使われました。

source: Parameterized Instances
ja: パラメータ化されたインスタンス

source: Parameters of the function are bound in `term`.
ja: その関数のパラメータは `term` 中で抑えられます。

source: Parameters of the function are bound in `term`\ ;
ja: 関数のパラメータは `term`\ 中で抑えられます;

source: Please report.
ja: 報告してください。

source: Practical tools
ja: 実用ツール

source: Preamble
ja: はじめに

source: Primitive Projections
ja: プリミティブ射影

source: Primitive Record Types
ja: プリミティブレコード型

source: Primitive projections extended the Calculus of Inductive Constructions with a new binary term constructor `r.(p)` representing a primitive projection `p` applied to a record object `r` (i.e., primitive projections are always applied).
ja: プリミティブ射影は Calculus of Inductive Constructions を新たな二項構築子 `r.(p)` で拡張し、これはあるレコードオブジェクト `r` に適用されるプリミティブ射影 `p` です (つまり、プリミティブ射影は常に適用されます)。

source: Printing constructions in full
ja: 全ての構成を表示する

source: Printing universes
ja: ユニバースを表示する

source: Projections obey the usual ``simpl`` flags of the ``Arguments`` command in particular.
ja: 特に射影は、``Arguments`` コマンドの通常の ``simpl`` フラグに従います。

source: Proof-General is available at https://proofgeneral.github.io/.
ja: Proof-General は https://proofgeneral.github.io/から入手可能です。

source: Record types
ja: レコード型

source: Records cannot be defined as part of mutually inductive (or co-inductive) definitions, whether with records only or mixed with standard definitions.
ja: レコードは、レコードのみであっても標準定義との混合であっても、相互帰納的 (または余帰納的) 定義の一部として定義することはできません。

source: Records defined with the ``Record`` keyword are not allowed to be recursive (references to the record's name in the type of its field raises an error).
ja: ``Record`` キーワードで定義されたレコードは再帰することは許されません (レコード名への参照がそのフィールドの型の中にあるとエラーが起きる)。

source: Reduction
ja: 簡約

source: Remark here that the fields ``Rat_bottom_cond`` depends on the field ``bottom`` and ``Rat_irred_cond`` depends on both ``top`` and ``bottom``.
ja: ここで注意すべきはフィールド ``Rat_bottom_cond`` がフィールド ``bottom`` に依存し、 ``Rat_irred_cond`` が ``top`` と ``bottom`` の両方に依存していることです。

source: Remark that the type of a particular identifier may depend on a previously-given identifier.
ja: 注目すべきは、特定の識別子の型は前に与えられた識別子に依存し得ることです。

source: Remark: Proof obligations are presented as several subgoals belonging to a Lemma `ident`\ :math:`_{\sf tcc}`.
ja: 注意: 証明課題は補題 `ident`\ :math:`_{\sf tcc}` に付随するいくつかのサブゴールとして提示されます。

source: Remark: To obtain the right principle, it is better to put rigid parameters of the function as first arguments.
ja: 注意: 正しい原理を得るには、第一引数として関数の固定されたパラメータを与えるのがより良いでしょう。

source: Sections and contexts
ja: セクションとコンテキスト

source: See :ref:`Sorts` for details.
ja: 詳細については :ref:`Sorts` を参照してください。

source: See the documentation of functional induction (:tacn:`function induction`) and ``Functional Scheme`` (:ref:`functional-scheme`) for how to use the induction principle to easily reason about the function.
ja: どのように帰納法の原理を使って簡単にその関数について論じるかについては関数的帰納法 (:tacn:`function induction`) と ``Functional Scheme`` (:ref:`functional-scheme`) のドキュメントを見てください。

source: See the table of contents for a complete list.
ja: 全ての項目を知りたい場合は、目次を参照してください。

source: Setting this flag also sets :opt:`Typeclasses Debug Verbosity` to 1.
ja: またこのフラグは :opt:`Typeclasses Debug Verbosity` を 1 に設定します。

source: Setting this option also sets :flag:`Typeclasses Debug`.
ja: このオプションを設定すると :flag:`Typeclasses Debug` も設定します。

source: Similarly, we could equip any other type with a comparison relation, and use the ``==`` notation on terms of this type.
ja: 同様に、他のどんな型でも比較関係を整えて、そしてこの型の項の上で ``==`` 記法を使うことが出来ます。

source: So each time a reflexive relation is needed, a preorder can be used instead.
ja: 従って反射的関係が必要になるたび、代わりに前順序を使うことができます。

source: Specifies a set of qualids which are displayed as constructors.
ja: コンストラクタとして表示される qualid の集合を指定します。

source: Specifies a set of qualids which are displayed as records.
ja: レコードとして表示される qualid の集合を指定します。

source: Still, no concrete type is in the ``EQ`` class.
ja: まだ ``EQ`` クラスの中には具体的な型はありません。

source: Substructures
ja: 部分構造

source: Substructures are components of a class which are instances of a class themselves.
ja: 部分構造はクラスのインスタンス自身であるようなクラスの構成要素です。

source: Such notation will be overloaded, and its meaning will depend on the types of the terms that are compared.
ja: そのような記法はオーバーロードされ、その意味は比較される項の型に依存することになるでしょう。

source: Summary of the commands
ja: コマンドの概要

source: Superclasses
ja: スーパークラス

source: Switches the type checking to Program (chapter :ref:`programs`) and uses the obligation mechanism to manage missing fields.
ja: 型検査を Program (章 :ref:`programs`) に切り替え、足りないフィールドを管理する(訳注: 証明)課題機構を使います。

source: Syntax of Record projections
ja: レコード射影構文

source: Table of contents
ja: 目次

source: Terms of |Gallina| can represent programs as well as properties of these programs and proofs of these properties.
ja: |Gallina| の項はプログラム・プログラムの性質・性質の証明を表現できます。

source: Thanks to :g:`nat_setoid` declared as canonical, the implicit arguments :g:`A` and :g:`B` can be synthesized in the next statement.
ja: :g:`nat_setoid` が正準として定義されているおかげで、次のステートメント内で暗黙引数 :g:`A` と :g:`B` が合成できます。

source: Thanks to the ``pair_EQty`` declaration, |Coq| is able to build a comparison relation for pairs whenever it is able to build a comparison relation for each component of the pair.
ja: ``pair_EQty`` 定義のおかげで、|Coq| はそのペアの各コンポーネントの比較関数を構築することが出来るときは、いつでもペアのための比較関係を構築することが出来ます。

source: The :cmd:`Class` command is used to declare a typeclass with parameters ``binders`` and fields the declared record fields.
ja: :cmd:`Class` コマンドはパラメータ ``binders`` とレコードフィールドを宣言するフィールドを伴う型クラスの宣言に使われます。

source: The :cmd:`Instance` command is used to declare a typeclass instance named ``ident`` of the class :cmd:`Class` with parameters ``t1`` to ``tn`` and fields ``b1`` to ``bi``, where each field must be a declared field of the class.
ja: :cmd:`Instance` コマンドは ``ident`` という名前の型クラスインスタンスを宣言するのに使われます。クラス :cmd:`Class` はパラメータ ``t1`` から ``tn`` とフィールド ``b1`` から ``bi`` を伴い、各フィールドはそのクラスの宣言されたフィールドでなければなりません。

source: The :cmd:`Record` construction is a macro allowing the definition of records as is done in many programming languages.
ja: :cmd:`Record` は多くのプログラミング言語で行われるようにレコードを定義できるようにするマクロです。

source: The Gallina specification language
ja: 仕様記述言語 Gallina

source: The ``!`` modifier switches the way a binder is parsed back to the regular interpretation of Coq.
ja: この ``!`` 修飾子は束縛子が解析されCoqの通常の解釈に解析される方法を切り替えます。

source: The ``Function`` construction also enjoys the ``with`` extension to define mutually recursive definitions.
ja: ``Function`` による構成はさらに ``with`` 拡張により相互再帰定義を定義することもできます。

source: The ``{}`` annotation is mandatory and must be one of the following:
ja: ``{}`` の注釈は強制であり、以下のうちの一つでないといけません。

source: The `coqtop` read-eval-print-loop can also be used directly, for debugging purposes.
ja: デバッグのために、 read-eval-print-loop である `coqtop` を直接用いることもできます。

source: The algorithm used to solve constraints is a variant of the :tacn:`eauto` tactic that does proof search with a set of lemmas (the instances).
ja: 制約を解消するために使われるアルゴリズムは :tacn:`eauto` タクティックの類型で、それは補題 (インスタンス) の集合をもって証明探索を行います。

source: The base namespace contains the definitions of the algebraic structure.
ja: この基本名前空間は代数構造の定義を含んでいます。

source: The basic reduction rule of a primitive projection is |p_i| ``(Build_``\ `R` |t_1| … |t_n|\ ``)`` :math:`{\rightarrow_{\iota}}` |t_i|.
ja: プリミティブ射影の基本的な簡約規則は |p_i| ``(Build_``\ `R` |t_1| … |t_n|\ ``)`` :math:`{\rightarrow_{\iota}}` |t_i| です。

source: The body of `ident` uses an incorrect elimination for `ident` (see :cmd:`Fixpoint` and :ref:`Destructors`).
ja: `ident` のボディーは `ident` に不正な除去を使っている (:cmd:`Fixpoint` と :ref:`Destructors` 参照)。

source: The class constant itself is declared rigid during resolution so that the class abstraction is maintained.
ja: そのクラス定数自身は(訳注: 制約を)解消する間は厳格に決定され、そのためそのクラスの抽象は維持されます。

source: The combination of these two facts is a simple form of proof search that |Coq| performs automatically while inferring canonical structures.
ja: これら二つの事実の組み合わせは正準構造を推論している間、|Coq| が自動的に行う証明探索の単純な形です。

source: The command for that is
ja: そのためのコマンドは

source: The compiled mode acts as a proof checker taking a file containing a whole development in order to ensure its correctness.
ja: コンパイルモードは、開発したもの全てを受け取り、その正当性を保証する証明チェッカとして機能します。

source: The compiled mode is run with the `coqc` command.
ja: コンパイルモードは `coqc` コマンドで実行されます。

source: The complete documentation of canonical structures can be found in :ref:`canonicalstructures`; here only a simple example is given.
ja: 正準構造の完全なドキュメントは :ref:`canonicalstructures` で見つけられます; ここでは単純な例のみを扱います。

source: The constraints on the internal level of the occurrences of Type (see :ref:`Sorts`) can be printed using the command
ja: Type の出現の内部的なレベルについての制約 (:ref:`Sorts` 参照) はこのコマンドを使うことで表示できます。

source: The corresponding grammar rules are given in the preceding grammar.
ja: 対応する文法規則は前述の文法の中で与えられています。

source: The declaration associates to the key ``*`` (the type constructor of pairs) the canonical comparison relation ``pair_eq`` whenever the type constructor ``*`` is applied to two types being themselves in the ``EQ`` class.
ja: その定義は型コンストラクタ ``*`` がそれら自身が ``EQ`` クラスの中にある二つの型に適用されるときは、キーである ``*`` (ペアの型コンストラクタ) に正準比較関係 ``pair_eq`` を関連付けます。

source: The declaration of canonical instances can now be way more compact:
ja: 正準インスタンスの定義は今やよりコンパクトになりえます。

source: The defined type enjoys eta-conversion definitionally, that is the generalized form of surjective pairing for records: `r` ``= Build_``\ `R` ``(``\ `r`\ ``.(``\ |p_1|\ ``) …`` `r`\ ``.(``\ |p_n|\ ``))``.
ja: 定義された型は定義的に eta 変換を使うことが出来、それは `r` ``= Build_``\ `R` ``(``\ `r`\ ``.(``\ |p_1|\ ``) …`` `r`\ ``.(``\ |p_n|\ ``))`` というレコードの全射ペアリングの一般的な形です。

source: The effect of the command is to automatically set the type of bound variables starting with `ident` (either `ident` itself or `ident` followed by one or more single quotes, underscore or digits) to be `type` (unless the bound variable is already declared with an explicit type in which case, this latter type is considered).
ja: このコマンドの効果は `ident` で始まる (`ident` 自身または `ident` に一つ以上のシングルクォート、アンダースコア、数字が続く) 束縛変数の型を自動的に `type` (その束縛変数が明示的な型とともに既に定義されている場合でない限り、後者の型と見なされる) に設定するものです。

source: The error message is telling that |Coq| has no idea on how to compare pairs of objects.
ja: このエラーメッセージは |Coq| がオブジェクトのペアをどのように比較するかについて知らないと言っています。

source: The examples are taken from :cite:`CSwcu`.
ja: 例は :cite:`CSwcu` から抜粋しています。

source: The fields do not have to be in any particular order, nor do they have to be all present if the missing ones can be inferred or prompted for (see :ref:`programs`).
ja: フィールドは特定の順序になっている必要はなく、もし足りないものが推論され得るか入力を促される (:ref:`programs` 参照) ならば、それらは全てが存在する必要もありません。

source: The fifth part documents a number of advanced features, including coercions, canonical structures, typeclasses, program extraction, and specialized solvers and tactics.
ja: 第5部では、型強制・正準構造・型クラス・プログラム抽出・特殊なソルバとタクティックといった、いくつかの高度な機能について説明します。

source: The first part describes the specification language, |Gallina|.
ja: 第1部では、仕様記述言語 |Gallina| について説明します。

source: The fixpoint equation of `ident`: `ident_equation`.
ja: `ident`: `ident_equation` という形の不動点方程式。

source: The following construction is telling Coq exactly how to do that.
ja: 以下の構成は Coq にまさにそれをどのように行うかを教えています。

source: The following experimental command is available when the ``FunInd`` library has been loaded via ``Require Import FunInd``:
ja: 以下の実験的なコマンドは ``FunInd`` ライブラリが ``Require Import FunInd`` によってロードされたときに有効になります:

source: The following line tests that, when we assume a type ``e`` that is in theEQ class, we can relate two of its objects with ``==``.
ja: 以下の行では EQ クラス内の型 ``e`` を仮定したとき、``==`` によってそのオブジェクト二つを関連付けることが出来ることをテストしています。

source: The following script registers an ``LEQ`` class for ``nat`` and for the type constructor ``*``.
ja: 以下のスクリプトは ``LEQ`` クラスに ``nat`` と型コンストラクタ ``*`` を登録します。

source: The following settings let you control the display format for types:
ja: 以下の設定は型の表示形式をコントロールします:

source: The following two constructions tell |Coq| how to canonically build the ``LE.type`` and ``EQ.type`` structure given an ``LEQ.type`` structure on the same type.
ja: 以下の二つの構成は |Coq| に ``LE.type`` と ``EQ.type`` 構造を同じ型上で与えられた ``LEQ.type`` 構造からどのように標準的に構築するかを伝えます。

source: The format is unspecified if `string` doesn’t end in ``.dot`` or ``.gv``.
ja: `string` が ``.dot`` または ``.gv`` で終わらない場合はフォーマットは指定されません。

source: The generalizing binders \`{ } and \`( ) work similarly to their explicit counterparts, only binding the generalized variables implicitly, as maximally-inserted arguments.
ja: 一般化された束縛子 \`{ } や \`( ) はそれらの明示的な場合の対応部分と同じように動作し、一般化された変数を最大限挿入された引数として暗黙に束縛するだけです。

source: The generation of the graph relation (`R_ident`) succeeded but the induction principle could not be built.
ja: グラフ関係 (`R_ident`) の生成は成功したが、その帰納法の原理は構築できません。
